In [6]:
import pandas as pd

In [81]:
df = pd.read_csv('../data/hiring-patterns.csv')
#df['freq'] = df.groupby('Gender')['Gender'].transform('count')
df.head()

,Applicant ID,Uni Ranking,Department of study,Internships,Skill Requirements met,Top 3 soft skills candidate selected from fixed list,Gender,Ethnicity,Disabled,Interviewed,Hired
0,18672399,8,Aerospace engineering,1,Yes,"Public speaking, Leadership, Work ethic",NaN,NaN,NaN,Yes,No
1,14550119,19,Economics,2,Yes,"Critical thinking, Sales / Marketing, Flexibil...",Male,White,No,Yes,Yes
2,18958952,5,Computer science,3,Yes,"Interpersonal skills, Flexibility / adaptabili...",Male,BME,No,Yes,Yes
3,11459626,14,Materials Science,4,Yes,"Work ethic, Problem solving, Project management",Female,BME,No,Yes,Yes
4,10164676,13,Statistics,5,No,"Public speaking, Emotional intelligence, Criti...",Male,BME,No,No,No

In [206]:
gender_not_interviewd_df = df.groupby('Gender')['Interviewed'].apply(lambda x: (x=='No').sum()).reset_index(name='dismissed')
gender_interviewd_df = df.groupby('Gender')['Interviewed'].apply(lambda x: (x=='Yes').sum()).reset_index(name='interviewed')
gender_hired_df = df.groupby('Gender')['Hired'].apply(lambda x: (x=='Yes').sum()).reset_index(name='hired')
gender_df = df.groupby('Gender').count()["Internships"].reset_index().join(gender_interviewd_df['interviewed']).join(gender_hired_df['hired'])
gender_df.rename(index=str, columns={"Internships": "Total"}, inplace=True)

gender_df

   Gender  Total  interviewed  hired
0  Female     38           13      8
1    Male     61           52     46

In [207]:
gender_df

   Gender  Total  interviewed  hired
0  Female     38           13      8
1    Male     61           52     46

In [208]:
df.groupby('Gender').count()["Internships"].reset_index()

   Gender  Internships
0  Female           38
1    Male           61

In [209]:
gender_df['Total2']=df["Gender"].value_counts()

In [210]:
gender_df

   Gender  Total  interviewed  hired  Total2
0  Female     38           13      8     NaN
1    Male     61           52     46     NaN

In [211]:
df.groupby('Uni Ranking')['Hired'].apply(lambda x: (x=='Yes').sum())

Uni Ranking
1     4
2     4
3     4
4     2
5     2
6     3
7     2
8     3
9     3
10    3
11    1
12    6
13    4
14    8
15    3
16    0
17    3
18    3
19    4
20    2
21    2
22    6
23    4
24    1
25    3
Name: Hired, dtype: int64

In [212]:
gender_df['ratio-interviewed'] = gender_df['interviewed']/gender_df['Total']
gender_df['ratio-hired'] = gender_df['hired']/gender_df['interviewed']

In [213]:
gender_df

   Gender  Total  interviewed  hired  Total2  ratio-interviewed  ratio-hired
0  Female     38           13      8     NaN           0.342105     0.615385
1    Male     61           52     46     NaN           0.852459     0.884615

In [214]:
#gender_df.set_index('Gender')

In [246]:
a = gender_df.loc[gender_df['Gender'] == 'Female']['ratio-interviewed'].values[0] / gender_df.loc[gender_df['Gender'] == 'Male']['ratio-interviewed'].values[0]
a

0.40131578947368424

In [247]:
a = gender_df.loc[gender_df['Gender'] == 'Female']['ratio-hired'].values[0] / gender_df.loc[gender_df['Gender'] == 'Male']['ratio-hired'].values[0]
a

0.6956521739130436

In [242]:
a = gender_df.loc[gender_df['Gender'] == 'Female']['ratio-hired'].values[0] / gender_df.loc[gender_df['Gender'] == 'Male']['ratio-hired'].values[0]
a

array([65])

In [269]:
df.groupby('Uni Ranking').count()['Applicant ID']

Uni Ranking
1     6
2     8
3     6
4     5
5     7
6     7
7     2
8     6
9     3
10    8
11    3
12    8
13    8
14    9
15    7
16    1
17    5
18    7
19    5
20    7
21    7
22    7
23    6
24    5
25    7
Name: Applicant ID, dtype: int64

In [273]:
df.groupby('Uni Ranking')['Hired'].apply(lambda x: (x=='Yes').sum())

Uni Ranking
1     4
2     4
3     4
4     2
5     2
6     3
7     2
8     3
9     3
10    3
11    1
12    6
13    4
14    8
15    3
16    0
17    3
18    3
19    4
20    2
21    2
22    6
23    4
24    1
25    3
Name: Hired, dtype: int64

In [274]:
df.groupby('Uni Ranking')['Hired'].apply(lambda x: (x=='Yes').sum())/df.groupby('Uni Ranking').count()['Applicant ID']

Uni Ranking
1     0.666667
2     0.500000
3     0.666667
4     0.400000
5     0.285714
6     0.428571
7     1.000000
8     0.500000
9     1.000000
10    0.375000
11    0.333333
12    0.750000
13    0.500000
14    0.888889
15    0.428571
16    0.000000
17    0.600000
18    0.428571
19    0.800000
20    0.285714
21    0.285714
22    0.857143
23    0.666667
24    0.200000
25    0.428571
dtype: float64